Crongus/AudioSampler_SP/CubeMX_STM32H7A3ZIT/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "i2s.h"
#include "memorymap.h"
#include "spdifrx.h"
#include "tim.h"
#include "usb_device.h"
#include "gpio.h"
#include "fmc.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"
#include "sdram_init.h"

#include "lcdhandler.h"
#include "keypad.h"
#include "stm32h7xx_it.h"
#include "DIX9211init.h"
#include "SineWave.h"
#include "dataCompression.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define TEST_END 50
#define TEST_BEGIN (TEST_END - 50)
#define BUFFER_SIZE 64
#define CSIZE1 BUFFER_SIZE/2
#define CSIZE2 CSIZE1/2
#define SPDIF_BUFF_SIZE  4
#define STEP_SIZE	2
#define TX	1
#define RX	0
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */
void testRAM(void);
int testFlash(uint8_t addr, uint8_t data);
void processData(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern NAND_HandleTypeDef hnand1; // for nand flash init
volatile int mode = RX;
volatile int drmode = 1;
extern int switchFlag;
extern const uint16_t sineLookupTable[];
volatile int errFlag = 0;
volatile int RxCplt[12];
volatile int TxCplt[12];
volatile int globalVar = 0;
int memtest = 1;
volatile int clipGo[12];
volatile int clipStore[12];
uint8_t dataReadyFlag=0; //FLAG TO START PROCESSING
volatile uint16_t adc_buf_i2s[BUFFER_SIZE]; //ARRAY FOR AUDIO INPUT
volatile uint16_t dac_buf_i2s[BUFFER_SIZE]; //ARRAY FOR AUDIO OUTPUT [BUFFER_SIZE]
volatile uint16_t channelbuf[CSIZE1]; // CSIZE1
volatile uint16_t depthbuf[CSIZE2]; // CSIZE2

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FMC_Init();
  MX_I2S1_Init();
  MX_I2S2_Init();
  MX_SPDIFRX_Init();
  MX_I2C1_Init();
  MX_I2C2_Init();
  MX_USB_DEVICE_Init();
  MX_TIM2_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */
	flashBoot();
	DIX9211init();
	int RxCnt = 0;
	int TxCnt = 0;
	extern SPDIFRX_HandleTypeDef hspdif; // for spdifrx init
	__IO uint32_t spdifrxBuf[SPDIF_BUFF_SIZE] = {0};
	//uint8_t fart[BUFFER_SIZE]
	uint16_t *fart1;
	//testRAM();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	//*(__IO uint16_t*) (SDRAM_BANK_ADDR) = 0xAAAA;
	for (int i = 0; i < 12; i++) {
		RxCplt[i] = 0;
		TxCplt[i] = 0;
	}
	HAL_I2S_Receive_DMA(&hi2s1, adc_buf_i2s, BUFFER_SIZE);
	HAL_I2S_Transmit_DMA(&hi2s2, dac_buf_i2s, BUFFER_SIZE);
	testRAM();
	//HAL_I2S_DMAPause(&hi2s2);
	//HAL_I2S_DMAResume(&hi2s2);
	while (1) {

		for(int clip = 0; clip < 12; clip++) {
			if (RxCplt[clip] >= 12000) { // 12000 for 45s at 64 buffer size
				RxCplt[clip] = 0;
			}
//(SDRAM_CX_BASE(clip) - 2000000000 + STEP_SIZE*(BUFFER_SIZE/2 + (BUFFER_SIZE/2) * RxCplt[clip])) >= SDRAM_CX_BASE(clip+1) - 2000000000
//SDRAM_CX_BASE(clip)
			//(SDRAM_CX_BASE(clip) + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * TxCplt[clip]))
			if (TxCplt[clip] >= 12000) {
				TxCplt[clip] = 0;
			}
		}
	}

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

		// The following 4 comments are here for reference and/or copy pasting from

		//HAL_NAND_Write_Page_8b
		//HAL_NAND_Read_Page_8b
		//uint8_t str[] = "Hello World\r\n";
		//CDC_Transmit_HS(str, sizeof(str));

  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /*AXI clock gating */
  RCC->CKGAENR = 0xFFFFFFFF;

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = 64;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 35;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief Peripherals Common Clock Configuration
  * @retval None
  */
void PeriphCommonClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Initializes the peripherals clock
  */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPI2|RCC_PERIPHCLK_SPI1
                              |RCC_PERIPHCLK_CKPER;
  PeriphClkInitStruct.PLL2.PLL2M = 33;
  PeriphClkInitStruct.PLL2.PLL2N = 279;
  PeriphClkInitStruct.PLL2.PLL2P = 6;
  PeriphClkInitStruct.PLL2.PLL2Q = 2;
  PeriphClkInitStruct.PLL2.PLL2R = 2;
  PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_0;
  PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOMEDIUM;
  PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
  PeriphClkInitStruct.CkperClockSelection = RCC_CLKPSOURCE_HSI;
  PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_PLL2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief NVIC Configuration.
  * @retval None
  */
static void MX_NVIC_Init(void)
{
  /* EXTI2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(EXTI2_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);
  /* EXTI3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(EXTI3_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);
  /* EXTI9_5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
  /* EXTI15_10_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
}

/* USER CODE BEGIN 4 */

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s) {
	if (mode == TX) {
		HAL_I2S_DMAPause(&hi2s1);
		for (int clip = 0; clip < 12; clip++) {
			//RxCplt[clip] = 0;
		}
		HAL_I2S_DMAResume(&hi2s2);
	}
	//channelDeletor(adc_buf_i2s + BUFFER_SIZE/2, channelbuf + CSIZE1/2, BUFFER_SIZE/2);
	for(int i = BUFFER_SIZE/2; i < BUFFER_SIZE; i+=2) {
		for (int clip = 0; clip < 12; clip++) {
			if (clipStore[clip] == 1)
				*(__IO uint16_t*) (SDRAM_CX_BASE(clip) + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * RxCplt[clip])) = adc_buf_i2s[i];
		}
		//*(__IO uint16_t*) (SDRAM_BANK_ADDR + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * RxCplt)) = adc_buf_i2s[i];
	}

	//HAL_I2S_Transmit_DMA(&hi2s2, dac_buf_i2s, BUFFER_SIZE);
	//RxCplt++;
	for (int clip = 0; clip < 12; clip++) {
			if (clipStore[clip] == 1) RxCplt[clip]++;
	}
	globalVar++;
}
void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s) {
	/* Mode Switching */
	if (mode == RX) {
		HAL_I2S_DMAPause(&hi2s2);
		for (int clip = 0; clip < 12; clip++) {
			//TxCplt[clip] = 0;
		}
		HAL_I2S_DMAResume(&hi2s1);
	}
	/* Data Reading */
	//for (int i = BUFFER_SIZE/2; i < BUFFER_SIZE; i+=2) {
		//dac_buf_i2s[i] = 0;
	//}
	for (int i = BUFFER_SIZE/2; i < BUFFER_SIZE; i+=2) {
		dac_buf_i2s[i] = 0;
		for (int clip = 0; clip < 12; clip++) {
			if (clipGo[clip] == 1)
				dac_buf_i2s[i] += *(__IO uint16_t*) (SDRAM_CX_BASE(clip) + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * TxCplt[clip]));
		}
		//dac_buf_i2s[i] = *(__IO uint16_t*) (SDRAM_BANK_ADDR + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * TxCplt));
	}
	//channelRestorer(channelbuf + CSIZE1/2, dac_buf_i2s + BUFFER_SIZE/2, CSIZE1);
	for (int clip = 0; clip < 12; clip++) {
		if (clipGo[clip] == 1) TxCplt[clip]++;
	}

	globalVar++;
}
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
	//RxCplt = 5;
	//channelDeletor(adc_buf_i2s, channelbuf, BUFFER_SIZE/2); // Fills
	for(int i = 0; i < BUFFER_SIZE/2; i+=2) {
		for (int clip = 0; clip < 12; clip++) {
			if (clipStore[clip] == 1)
				*(__IO uint16_t*) (SDRAM_CX_BASE(clip) + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * RxCplt[clip])) = adc_buf_i2s[i];
		}
		//*(__IO uint16_t*) (SDRAM_BANK_ADDR + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * RxCplt)) = adc_buf_i2s[i];
	}
}
void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
	//TxCplt = 5;
	//for(int i = 0; i < BUFFER_SIZE/2; i+=2) {
	//	dac_buf_i2s[i] = 0;
	//}
	for(int i = 0; i < BUFFER_SIZE/2; i+=2) {
		dac_buf_i2s[i] = 0;
		for (int clip = 0; clip < 12; clip++) {
			if (clipGo[clip] == 1)
				dac_buf_i2s[i] += *(__IO uint16_t*) (SDRAM_CX_BASE(clip) + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * TxCplt[clip]));
		}
		//dac_buf_i2s[i] = *(__IO uint16_t*) (SDRAM_BANK_ADDR + STEP_SIZE*(i/2 + (BUFFER_SIZE/2) * TxCplt));
	}
	// channelRestorer(channelbuf, dac_buf_i2s, CSIZE1);
}
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s) {
	errFlag = 1;
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	int key = GetKey();
	HAL_Delay(200);
	if (key <= 12 && key >= 0) {

		if (mode == TX) clipGo[key] = !clipGo[key]; // Toggle playback
		if (mode == RX)  {
			for (int clip = 0; clip < 12; clip++) { // Clear every storage, only store 1 at a time
				if (clip != key) clipStore[clip] = 0;
			}
			HAL_Delay(10);
			clipStore[key] = !clipStore[key]; // Turn store off and on
		}
	}
	// 15 16 and 17 will be pitch control
	if (key == 15) { // Pitch Down
		HAL_I2S_DMAPause(&hi2s2);
		HAL_I2S_DeInit(&hi2s2);
		hi2s2.Init.AudioFreq = 72000UL;
		HAL_I2S_Init(&hi2s2);
		HAL_I2S_Transmit_DMA(&hi2s2, dac_buf_i2s, BUFFER_SIZE);
	} else if (key == 16) { // Pitch Normal
		HAL_I2S_DMAPause(&hi2s2);
		HAL_I2S_DeInit(&hi2s2);
		hi2s2.Init.AudioFreq = 8000UL;
		HAL_I2S_Init(&hi2s2);
		HAL_I2S_Transmit_DMA(&hi2s2, dac_buf_i2s, BUFFER_SIZE);
	} else if (key == 17) { // Pitch Up
		HAL_I2S_DMAPause(&hi2s2);
		HAL_I2S_DeInit(&hi2s2);
		hi2s2.Init.AudioFreq = 8800UL;
		HAL_I2S_Init(&hi2s2);
		HAL_I2S_Transmit_DMA(&hi2s2, dac_buf_i2s, BUFFER_SIZE);
	}
	/*switch (key) { // Assumes key cant be changed anywhere else
		case 0:
			if (mode == TX) clipGo[key] = !clipGo[key];
			if (mode == RX) clipStore[key] = !clipStore[key];
			else
			break;
		case 1:
			clipGo[key] = !clipGo[key];
			break;
		case 2:
			clipGo[key] = !clipGo[key];
			break;
		case 3:
			clipGo[key] = !clipGo[key];
			break;
		case 4:
			clipGo[key] = !clipGo[key];
			break;
		case 5:
			clipGo[key] = !clipGo[key];
			break;
		case 6:
			clipGo[key] = !clipGo[key];
			break;
		case 7:
			clipGo[key] = !clipGo[key];
			break;
		case 8:
			clipGo[key] = !clipGo[key];
			break;
		case 9:
			clipGo[key] = !clipGo[key];
			break;
		case 10:
			clipGo[key] = !clipGo[key];
			break;
		case 11:
			clipGo[key] = !clipGo[key];
			break;
		case 12:
			clipGo[key] = !clipGo[key];
			break;
		case 13:
			break;
		case 14:
			break;
		case 15:
			break;
		case 16:
			break;
		case 17:
			break;
		case 18:
			break;
		case 19:
			break;
		default:
			break;
	} */
	if (key == 19) {
		HAL_Delay(10);
		for (int i = 0; i < 12; i++) {
			clipGo[i] = 0;
			clipStore[i] = 0;
		}
		mode = !mode;
	}

}

int testFlash(uint8_t addr, uint8_t data) {
	int ret = 1;
	//NAND_AddressTypeDef Address;
	//Address.Page = 0;
	//Address.Plane = 1;
	//Address.Block = 5;
	//HAL_NAND_Read_Page();
	*(uint8_t*) (FLASH_COMMON_BANK_ADDR + FLASH_ADDRESS_OFFSET) = addr;
	*(uint8_t*) (FLASH_COMMON_BANK_ADDR + FLASH_DATA_OFFSET) = data;
	ret = *(uint8_t*) (FLASH_COMMON_BANK_ADDR + FLASH_DATA_OFFSET);
	return ret;
}

void testRAM(void) {

	volatile uint16_t buffer[TEST_END - TEST_BEGIN];
	for (volatile int i = TEST_BEGIN; i < TEST_END; i++) {
		*(__IO uint16_t*) (SDRAM_BANK_ADDR + 4 * i) = 0x0000; // write to a bunch of memory in the ram
	}
	for (volatile int i = TEST_BEGIN; i < TEST_END; i++) {
		buffer[i - TEST_BEGIN] = *(__IO uint16_t*) (SDRAM_BANK_ADDR + 4 * i); // read from the same memory
		if (buffer[i - TEST_BEGIN] == 0x0000) { // check if its good data

		} else {
			memtest = 0;
		}
	}

	if (memtest) { //printfs
		uint8_t testr[] = "Total RAM Success\r\n";
		CDC_Transmit_HS(testr, sizeof(testr));
	} else {
		uint8_t testr[] = "Partial RAM Failure\r\n";
		CDC_Transmit_HS(testr, sizeof(testr));
	}

}

/* USER CODE END 4 */

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0xC0000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_16MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x80000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();

	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
